       IDENTIFICATION DIVISION.
       PROGRAM-ID. t_calc.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
          01 WS-NETWORTH PIC S9(11)V99.
          01 WS-TAXRATE PIC 9(3)V9(3).
          01 WS-TAXVALUE PIC S9(11)V9(02).
          01 WS-NUM11 PIC S9(1)V9(03).
          01 WS-GROSSVALUE PIC S9(11)V99.

       PROCEDURE DIVISION.
           COMPUTE WS-NUM11= WS-TAXRATE/100
           COMPUTE WS-GROSSVALUE = WS-NETWORTH * (1 + WS-NUM11)
           COMPUTE WS-TAXVALUE = WS-GROSSVALUE - WS-NETWORTH
           EXIT PROGRAM.